app/Http/Controllers/Api/AmenityController.php

select * from `amenities` where `name` LIKE '%wifi%' limit 10 offset 0
select count(*) as aggregate from `amenities` where `name` LIKE '%wifi%'
---
    public function index(Request $request)
    {
        $search_term = $request->input('q');
        $page = $request->input('page');

        if ($search_term)
        {
            $results = Amenity::where('name', 'LIKE', '%'.$search_term.'%')->paginate(10);